const parfumes = [
    {
        id: 'el1',
        name: 'Jaques Fath Curacao bay',
        img: 'static/img/Faths_Curacao_Bay.jpg',
        year: 2015,
        nose: 'Cécile Zarokian',
        notesT: 'Танжерин, Лимон, Апельсин, Петитгрейн и Зеленые ноты;',
        notesM: 'Франжипани, Морские ноты и Черная смородина;',
        notesB: 'Белый мускус, Серая амбра и Древесные ноты.',
        description: 'Жара прошла, воспоминания остались. Это самый идеальный парфюм на жару. Пахнет солёными брызгами моря и кокосом! Залив Кюрасао. Экзотический остров. Брызги солёного моря, жаркое солнце и коктели в кокосе. При жаре за 30, прекрасно раскрывается. Идёшь и чувствуешь освежающий бриз. Ко мне даже принюхивались люди. Когда зашла с жары в помещение с конционером ощутила прям волну аромата.<br>В нём очень приятно в жару ходить, он освежает как будто и не так жарко даже.<br>Очень приятный и ненавязчивый.<br>Стартует с лёгкой цитрусовой нотой, потом цитрус уходит и остаётся приятный кокос и брызги моря. В целом в парфюме всё очень ладно, складно и ничего не выпирает. Он нежный и лёгкий',
        popup: 'popup1',
    },
    {
        id: 'el2',
        name: 'Rance Eugenie',
        img: 'static/img/Rance_Eugenie.jpg',
        year: 2006,
        nose: 'Jeanne Sandra Rance',
        notesT: 'Белые цветы, Дыня, Ландыш, Мандарин, Бергамот, Маракуйя, Черная смородина и Иланг-иланг;',
        notesM: 'Персик, Жасмин, Лист фиалки, Магнолия, Роза и Нероли;',
        notesB: 'Ирис, Сандал, Ваниль, Дубовый мох, Амбра и Ветивер.',
        description: 'Чем пахнет нежность? Точнее, как пахнет нежность. Этот запах сама нежность. Так пахнет прикосновение к нежнейшему пуху. Ни одной резкой ноты. Нежнейшая нежная нежность и имя ей - Евгени. (Меня поправили, оно таки Öжени, и живите с этим как хотите). Именно так, на французский манер.<br>Вот умеет Ранце сделать нежно и стойко. Правда, я поначалу не поняла их. Тончайший запах мгновенно улетучивался. Я убрала подальше, на полку. И сегодня достала, да не просто достала и очень обильно нанесла. Наверно пшиков 8. И пошла. А он восхитительно пах 6 часов и сейчас пахнет, но близко к коже.<br>А теперь вернёмся с нежных облаков на грешную Землю. В парфюме длинный список нот. И вот удивительно, а там не слышу только фиалки. Точнее, они мне кажутся там. Я, вообще, не любитель разбивать такие, сложносочинённые, парфюмы на ноты. Я их вдыхаю всей композицией. И тащуууусь, как кот с валерьянки.<br>',
        popup: 'popup2',
    },
    {
        id: 'el3',
        name: 'Chanel Paris-Venise',
        img: 'static/img/Chanel_Paris_Venise.jpg',
        year: 2018,
        nose: 'Olivier Polge',
        notesT: 'Лимон, Апельсин, Петитгрейн, Бергамот и Розовый перец;',
        notesM: 'Ирис, Нероли, Иланг-иланг, Роза и Герань;',
        notesB: 'Бобы тонка, Белый мускус, Ваниль, Фиалка, Корень ириса и Бензоин.',
        description: 'Часть круизной коллекции. путешествие Париж - Венеция по одному названию обещает красоту, романтику и веселье. Аромат приятный, тонкий и манит погулять, как по узким улочкам Венеции, так и широким проспектам Парижа. Это про женщину, которая везде своя.',
        popup: 'popup3',
    },
    {
        id: 'el4',
        name: 'Chanel Coromandel',
        img: 'static/img/Chanel_Coromandel_4ml.jpg',
        year: 2016,
        nose: 'Jacques Polge',
        notesT: 'Горький апельсин, Цитрусы и Нероли;',
        notesM: 'Пачули, Корень ириса, Роза и Жасмин;',
        notesB: 'Бензоин, Белый шоколад, Амбра, Олибанум, Ладан, Древесные ноты и Мускус.',
        description: 'У меня пробник 4мл в чудесной коробочке. Выглядит, как прекрасная игрушка. На самом деле упаковки Шанель - отдельный респект за простоту, игривость и аристократичность.<br>Сам парфюм это аромат деревянной шкатулки с драгоценными, экзотическими маслами, специями и цветами, которые немного протекли и их запахи смешались. Такой мог привезти дочери или жене купец из дальней поездки. Или городская ведьма, там хранит свои ингредиенты.<br>Аромат в целом очень спокойный, нежный и очень дорогой. Очень важно оценивать аромат в целом, не разбивая на ноты.<br>Так что же у нас там. Это шоколад, ладан, ваниль, корень ириса, пару лепестков розы, капля жасмина, пачули и мускус.<br>Аромат немного тяжеловат, но при этом нежен. При таких то ингридиентах, будь это не Шанель, мы получили бы сладкую гадость, но это Шанель. Очень сбалансированный аромат. Все ноты звучат так, что бы не перебивать друг друга, а слажено доставлять нам ольфакторное удовольствие той самой шкатулки из дерева. Просто ларец с сокровищами.<br>',
        popup: 'popup4',
    },
    {
        id: 'el5',
        name: 'Chanel N.5 EDT',
        img: 'static/img/Chanel_5_EDT.jpg',
        year: 1924,
        nose: 'Ernest Beaux',
        notesT: 'Альдегиды, Иланг-иланг, Нероли, Лимон и Бергамот;',
        notesM: 'Ирис, Жасмин, Роза, Корень ириса и Ландыш;',
        notesB: 'Цибетин, Сандал, Мускус, Дубовый мох, Ветивер, Амбра, Ваниль и Пачули',
        description: 'Первое, что отмечаешь при затесте, это огроную разницу в звучании между туалетной водой(EDT) и парфюмерной водой (EDP).<br>Так пахнет элегантность, чувство стиля и уверенность в себе.<br>Подумать только парфюму сто лет исполнилось в 2021, а туалетная вода отпразнует свой юбилей в 2024. И ведь это бестселлер дома Шанель. Именно номер 5 вытащил дом после войны из финансовой ямы.<br>На картинке слева, это современный флакон, а вот справа винтажный. Да-да, я пользуюсь винтажами.',
        popup: 'popup5',
    },
    {
        id: 'el6',
        name: 'Chanel N.5 Hair Fragrance',
        img: 'static/img/Chanel_5_HairMist.jpg',
        year: 2021,
        nose: '',
        notesT: 'Роза и жасмин;',
        notesM: '',
        notesB: '',
        description: 'Дымка для волос. С простым составом и знакомым звучанием Chanel N.5, но! К элегантной строгости 5ки добавили лёгкости в звучание и розу. Какая там роза на стартею Лёгкая, звенящая, такая свежая и стойкая. Дымки для волос не подразумевают яркого звучания, это скорее некая ароматная вуаль. В составе нет спиртов, поэтому не вредят волосам, но остаются на весь день. Так приятно ощутить этот тонкй аромат при повороте головы.',
        popup: 'popup6',
    },
    {
        id: 'el7',
        name: 'Chanel N.5 LEua',
        img: 'static/img/Chanel_5_Leau.jpg',
        year: 2016,
        nose: 'Olivier Polge',
        notesT: 'Альдегиды, Лимон, Нероли, Мандарин, Апельсин, Бергамот и Лайм;',
        notesM: 'Иланг-иланг, Жасмин и Майская роза;',
        notesB: 'Белый мускус, Корень ириса, Кедр и Ваниль',
        description: 'Chanel N.5 LEua',
        popup: 'Лёгкий, весёлый, искрящийся аромат мороза. Удивительное переосмысление N.5. Сохранили элегантность, но добавили задора. В нём хочется радоваться первому снегу и лепить снежную бабу!',
    },
    {
        id: 'el8',
        name: 'Chanel Coco EDP',
        img: 'static/img/Chanel_Coco_EDP.jpg',
        year: 1984,
        nose: 'Jacques Polge',
        notesT: 'Болгарская роза, Кориандр, Персик, Жасмин и Мандарин;',
        notesM: ' Гвоздика (пряность), Роза, Цветок апельсина, Мимоза и Клевер;',
        notesB: 'Амбра, Сандал, Бобы тонка, Цибетин, Опопонакс, Ваниль и Лабданум.',
        description: 'С таким то именем! Удивительно роскошный аромат. В нём хочется лечь на шёлковые простыми и предаться неге. Не обязывающий, но очень достойный представитель своего дома. При затесте современной и винтажной версий сделала удивительное открытие, композиция в винтажной версии более объёмная! Они не различаются по нотам, но вот объём самого аромата! Меня это очень удивило.',
        popup: 'popup8',
    },
    {
        id: 'el9',
        name: 'SG79 STHLM N19',
        img: 'static/img/SG79STHLM_N19.jpg',
        year: 2019,
        nose: 'Парфюмеры дома SG79 STHLM',
        notesT: 'Апельсин, Кардамон и Розовый перец;',
        notesM: 'Имбирь, Мускатный орех, Элеми и Кориандр;',
        notesB: 'Бензоин, Лимон и Тиаре',
        description: 'Написанно, что летний. Не летний, сейчас искрится и благоухает. Аромат лунной ночи, когда ты лежишь на даче в гамаке, ещё не холодно, но осень где то рядом, и ешь свежие и ароматные груши. При этом баню не топили, грялки не пололи, нарвали груш и наслождаемся тишиной и собой. Аромат тихих разговоров. Сладких поцелуев со вкусом груши. Для меня это дача, лето, вечер и романтика. Он не сильно сладкий. Очень женственный, очень нежный. Точно в пирамиде нет груши, но мне прям груша и всё тут.<br>Норма пару пшиков. На волосы ещё не тестировала.<br>Называется он SG 79 STHLM No. 19. Шведский нишевый бренд, стойкость у него безумная, как у всех "шведов".',
        popup: 'popup9',
    },
    {
        id: 'el10',
        name: 'Amouage Opus II',
        img: 'static/img/Amouage_Opus2.jpg',
        year: 2010,
        nose: 'Michèle Saramito',
        notesT: 'Лаванда, Полынь, Розовый перец и Перец;',
        notesM: 'Кардамон, Корица, Жасмин и Роза;',
        notesB: 'Ладан, Вирджинский кедр, Пачули, Амбра и Мускус.',
        description: 'Опус номер 2. Звучит, как музыкальное произведение. При том, что он Амуаж, звучит больше в стиле английских парфюмерных домов. Травы, но не трава. Именно луговые травы. Горький и ароматный, немного мыльный. Возникает ищущение, что мы постирали рубахи ароматным мылом и развешиваем их на верёвке на заднем дворе, где то в лугах Англии. Погода так себе, дождливое лето, ветер, луга и где то там волнуется море, но самого аромата моря нет, есть лёгкая нотка влажного воздуха. Отлично подойдёт женщинам и мужчинам. Он настолько посередине между мужским и женским, что даже удивительно, как так то! И почему арабы не отсыпали нам арабских нот, а дали эту влажную, луговую Европу в лучших традициях Англии.',
        popup: 'popup10',
    },
];

//create card from array
const toHTML = parfume => `
<div class="card">
    <img src="${parfume.img}">
    <div class="parf_card">
        <p><span>${parfume.name}</span></p>
        <p><span>Год выпуска: </span> ${parfume.year}</p>
        <p><span>Парфюмер: </span> ${parfume.nose}</p>
        <p><span>Верхние ноты: </span>${parfume.notesT}</p>
        <p><span>Ноты сердца: </span>${parfume.notesM}</p>
        <p><span>Ноты базы: </span>${parfume.notesB}</p>
        <br>
        <button class="descBtn" data-popup=${parfume.popup}>Description</button>
    </div>
</div>
<div id=${parfume.popup} class="popup">
    <div class="popup-content">
        <div class="popup-header">
                <h2>${parfume.name}</h2>
                <span class="close">&times;</span>
        </div>
        <div class="popup-body">
            <img src="${parfume.img}">
            <div class="popup-card">
                <p><span>Год выпуска: </span> ${parfume.year}</p><br>
                <p><span>Парфюмер: </span> ${parfume.nose}</p><br>
                <p><span>Верхние ноты: </span>${parfume.notesT}</p><br>
                <p><span>Ноты сердца: </span>${parfume.notesM}</p><br>
                <p><span>Ноты базы: </span>${parfume.notesB}</p><br>
                <p><span>Описание: </span>${parfume.description}</p>
            </div>
        </div>
        <div class="popup-footer">
            <h3></h3>
        </div>
    </div>
</div>
`

function render() {
    const html = parfumes.map(toHTML).join('')
    document.querySelector('#container').innerHTML = html
}

render()

//popup window
var popupsToddle = document.querySelectorAll('.descBtn'),
    popupClose = document.querySelectorAll('.close');

const body = document.body;


popupsToddle.forEach(function (item) {
    item.addEventListener('click', function () {
        var popupName = item.getAttribute('data-popup');
        document.getElementById(popupName).style.display = "block";
        
        //locked scrolling + CSS body &.locked {overflow: hidden}
        body.classList.add('_locked');
    })

})

popupClose.forEach(function (item) {
    item.addEventListener('click', function () {
        var popup = item.closest('.popup');
        popup.style.display = "none";
        body.classList.remove('_locked');
    })

})

window.onclick = function (e) {
    if (e.target.classList.contains('popup')) {
        e.target.style.display = "none";
        body.classList.remove('_locked');
    }
};